posts/rust-optimization/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Rust Optimization | chimez's blog</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/ipython.min.css" rel="stylesheet" type="text/css">
<link href="../../assets/css/nikola_ipython.css" rel="stylesheet" type="text/css">
<link href="https://fonts.googleapis.com/css?family=Playfair+Display:700,900" rel="stylesheet">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" hreflang="en" href="../../rss.xml">
<link rel="canonical" href="https://chimez.github.io/posts/rust-optimization/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="chimez">
<link rel="prev" href="../meson/" title="meson" type="text/html">
<meta property="og:site_name" content="chimez's blog">
<meta property="og:title" content="Rust Optimization">
<meta property="og:url" content="https://chimez.github.io/posts/rust-optimization/">
<meta property="og:description" content="Rust 性能优化


这里所称性能优化实际上就是 Rust 的正确打开方式，因为 Rust 的安全特性导致按照 c/c++ 方式直接写程序有可能速度会比较慢。




避免边界检查



参考资料


这里 的说明





使用 slice 为编译器提示长度


vec 等类型的参数传递给函数后，在函数内部重新用 slice 的方式定义变量


    fn f_for(a: &amp;Vec&lt;f64">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2021-05-20T14:33:34+08:00">
<meta property="article:tag" content="rust">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Header and menu bar -->
<div class="container">
      <header class="blog-header py-3"><div class="row nbb-header align-items-center">
          <div class="col-md-3 col-xs-2 col-sm-2" style="width: auto;">
            <button class="navbar-toggler navbar-light bg-light nbb-navbar-toggler" type="button" data-toggle="collapse" data-target=".bs-nav-collapsible" aria-controls="bs-navbar" aria-expanded="false" aria-label="Toggle navigation">
                <span class="navbar-toggler-icon"></span>
            </button>
            <div class="collapse bs-nav-collapsible bootblog4-search-form-holder">
                
            </div>
        </div>
          <div class="col-md-6 col-xs-10 col-sm-10 bootblog4-brand" style="width: auto;">
            <a class="navbar-brand blog-header-logo text-dark" href="../../">

            <span id="blog-title">chimez's blog</span>
        </a>
          </div>
            <div class="col-md-3 justify-content-end align-items-center bs-nav-collapsible collapse flex-collapse bootblog4-right-nav">
            <nav class="navbar navbar-light bg-white"><ul class="navbar-nav bootblog4-right-nav">
<li class="nav-item">
    <a href="index.org" id="sourcelink" class="nav-link">Source</a>
    </li>


                    
            </ul></nav>
</div>
    </div>
</header><nav class="navbar navbar-expand-md navbar-light bg-white static-top"><div class="collapse navbar-collapse bs-nav-collapsible" id="bs-navbar">
            <ul class="navbar-nav nav-fill d-flex w-100">
<li class="nav-item">
<a href="../../archive.html" class="nav-link">Archive</a>
                </li>
<li class="nav-item">
<a href="../../categories/" class="nav-link">Tags</a>
                </li>
<li class="nav-item">
<a href="../../rss.xml" class="nav-link">RSS feed</a>

                
            </li>
</ul>
</div>
<!-- /.navbar-collapse -->
</nav>
</div>

<div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        
        
        
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Rust Optimization</a></h1>

        <div class="metadata">
            <p class="byline author vcard p-author h-card"><span class="byline-name fn p-name" itemprop="author">
                    chimez
            </span></p>
            <p class="dateline">
            <a href="." rel="bookmark">
            <time class="published dt-published" datetime="2021-05-20T14:33:34+08:00" itemprop="datePublished" title="2021-05-20 14:33">2021-05-20 14:33</time></a>
            </p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="outline-container-org5a85a01" class="outline-2">
<h2 id="org5a85a01">Rust 性能优化</h2>
<div class="outline-text-2" id="text-org5a85a01">
<p>
这里所称性能优化实际上就是 Rust 的正确打开方式，因为 Rust 的安全特性导致按照 c/c++ 方式直接写程序有可能速度会比较慢。
</p>
</div>

<div id="outline-container-org19dbdf9" class="outline-3">
<h3 id="org19dbdf9">避免边界检查</h3>
<div class="outline-text-3" id="text-org19dbdf9">
</div>
<div id="outline-container-org5d3f916" class="outline-4">
<h4 id="org5d3f916">参考资料</h4>
<div class="outline-text-4" id="text-org5d3f916">
<ol class="org-ol">
<li>
<a href="https://users.rust-lang.org/t/how-to-malloc-an-array-in-heap-like-c/27827/40">这里</a> 的说明</li>
</ol>
</div>
</div>

<div id="outline-container-orge0776a0" class="outline-4">
<h4 id="orge0776a0">使用 slice 为编译器提示长度</h4>
<div class="outline-text-4" id="text-orge0776a0">
<p>
vec 等类型的参数传递给函数后，在函数内部重新用 slice 的方式定义变量
</p>

<div class="highlight"><pre><span></span>    fn f_for(a: &amp;Vec&lt;f64&gt;, b: &amp;mut Vec&lt;f64&gt;){
	// 不可变量直接用长度做 slice
	let a = &amp;a[..a.len()];
	// 可变量先定义一个长度再做 slice
	let len_b = b.len();
	let b = &amp;mut b[..len_b];
    }
</pre></div>
</div>
</div>

<div id="outline-container-org14a899f" class="outline-4">
<h4 id="org14a899f">尽可能使用迭代器而不是指标循环</h4>
<div class="outline-text-4" id="text-org14a899f">
<p>
迭代器中的边界检查被优化掉了
</p>

<div class="highlight"><pre><span></span>    for (i, ai) in a.iter().enumerate(){
	do_something();
    }

    // 而不是

    for i in 0..n{
	a[i];
    }
</pre></div>
</div>
</div>

<div id="outline-container-org02a47b0" class="outline-4">
<h4 id="org02a47b0">不得不用指标获得值时用 unsafe 的非检查方式</h4>
<div class="outline-text-4" id="text-org02a47b0">
<p>
当确保指标不会越界时就可以大胆使用 unsafe
</p>

<div class="highlight"><pre><span></span>    for i in 0..n{
	unsafe {
	    a.get_unchecked(i);
	}
    }

    // not 
    a[i];
</pre></div>
</div>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/rust/" rel="tag">rust</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../meson/" rel="prev" title="meson">Previous post</a>
            </li>
        </ul></nav></aside></article><!--End of body content--><footer id="footer">
            Contents © 2021         <a href="mailto:chimez@163.com">chimez</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
            
        </footer>
</div>
</div>


        <script src="../../assets/js/all-nocdn.js"></script><script>
    baguetteBox.run('div#content', {
        ignoreClass: 'islink',
        captions: function(element){var i=element.getElementsByTagName('img')[0];return i===undefined?'':i.alt;}});
    </script>
</body>
</html>
